<?xml version="1.0" encoding="utf-8" ?> 
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//RU" 
  "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">  
<!--http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd-->  
<html xml:lang="ru" xmlns="http://www.w3.org/1999/xhtml"  
> 
<head><title></title> 
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" /> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)" /> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)" /> 
<!-- xhtml,charset=utf-8,html --> 
<meta name="src" content="list.tex" /> 
<meta name="date" content="2011-02-07 01:40:00" /> 
<link rel="stylesheet" type="text/css" href="list.css" /> 
</head><body 
>
<!--l. 32--><p class="noindent" >&#x0412;&#x043E; &#x0432;&#x0441;&#x0435;&#x0445; &#x0437;&#x0430;&#x0434;&#x0430;&#x0447;&#x0430;&#x0445; &#x0441;&#x0447;&#x0438;&#x0442;&#x0430;&#x0435;&#x0442;&#x0441;&#x044F;, &#x0447;&#x0442;&#x043E; &#x0430;&#x0440;&#x0438;&#x0444;&#x043C;&#x0435;&#x0442;&#x0438;&#x0447;&#x0435;&#x0441;&#x043A;&#x0438;&#x0435; &#x0434;&#x0435;&#x0439;&#x0441;&#x0442;&#x0432;&#x0438;&#x044F; &#x0441; &#x0446;&#x0435;&#x043B;&#x044B;&#x043C;&#x0438; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430;&#x043C;&#x0438; &#x0432;&#x044B;&#x043F;&#x043E;&#x043B;&#x043D;&#x044F;&#x044E;&#x0442;&#x0441;&#x044F; &#x0437;&#x0430; <span 
class="cmmi-10">O</span><span 
class="cmr-10">(1)</span>.
     </p><ol  class="enumerate1" >
     <li 
  class="enumerate" id="x1-3x1">&#x0417;&#x0430;&#x0434;&#x0430;&#x043D;&#x043E;  &#x043C;&#x043D;&#x043E;&#x0436;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E;  &#x0438;&#x0437;  <span 
class="cmmi-10">n </span>&#x0446;&#x0435;&#x043B;&#x044B;&#x0445;  &#x0447;&#x0438;&#x0441;&#x0435;&#x043B;.  &#x0422;&#x0440;&#x0435;&#x0431;&#x0443;&#x0435;&#x0442;&#x0441;&#x044F;  &#x043D;&#x0430;&#x0439;&#x0442;&#x0438;  &#x0441;&#x0443;&#x043C;&#x043C;&#x0443;  &#x043F;&#x0440;&#x043E;&#x0438;&#x0437;&#x0432;&#x0435;&#x0434;&#x0435;&#x043D;&#x0438;&#x0439;  &#x0432;&#x0441;&#x0435;&#x0445;  &#x043F;&#x043E;&#x0434;&#x043C;&#x043D;&#x043E;&#x0436;&#x0435;&#x0441;&#x0442;&#x0432;
     &#x0437;&#x0430;&#x0434;&#x0430;&#x043D;&#x043D;&#x043E;&#x0433;&#x043E; &#x043C;&#x043D;&#x043E;&#x0436;&#x0435;&#x0441;&#x0442;&#x0432;&#x0430;. <span 
class="cmmi-10">O</span><span 
class="cmr-10">(</span><span 
class="cmmi-10">n</span><span 
class="cmr-10">)</span>.
     </li>
     <li 
  class="enumerate" id="x1-5x2">&#x0417;&#x0430;&#x0434;&#x0430;&#x043D;&#x043E; <span 
class="cmmi-10">n </span>&#x043F;&#x0440;&#x044F;&#x043C;&#x043E;&#x0443;&#x0433;&#x043E;&#x043B;&#x044C;&#x043D;&#x0438;&#x043A;&#x043E;&#x0432; &#x043D;&#x0430; &#x043F;&#x043B;&#x043E;&#x0441;&#x043A;&#x043E;&#x0441;&#x0442;&#x0438; &#x0441;&#x043E; &#x0441;&#x0442;&#x043E;&#x0440;&#x043E;&#x043D;&#x0430;&#x043C;&#x0438;, &#x043F;&#x0430;&#x0440;&#x0430;&#x043B;&#x043B;&#x0435;&#x043B;&#x044C;&#x043D;&#x044B;&#x043C;&#x0438; &#x043E;&#x0441;&#x044F;&#x043C; &#x043A;&#x043E;&#x043E;&#x0440;&#x0434;&#x0438;&#x043D;&#x0430;&#x0442;. &#x041D;&#x0430;&#x0439;&#x0434;&#x0438;&#x0442;&#x0435;
     &#x043F;&#x043B;&#x043E;&#x0449;&#x0430;&#x0434;&#x044C; &#x043F;&#x0435;&#x0440;&#x0435;&#x0441;&#x0435;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F; &#x0437;&#x0430;&#x0434;&#x0430;&#x043D;&#x043D;&#x044B;&#x0445; &#x043F;&#x0440;&#x044F;&#x043C;&#x043E;&#x0443;&#x0433;&#x043E;&#x043B;&#x044C;&#x043D;&#x0438;&#x043A;&#x043E;&#x0432;. <span 
class="cmmi-10">O</span><span 
class="cmr-10">(</span><span 
class="cmmi-10">n</span><sup><span 
class="cmr-7">2</span></sup><span 
class="cmr-10">)</span>.
     </li>
     <li 
  class="enumerate" id="x1-7x3">&#x0412; &#x043F;&#x0440;&#x044F;&#x043C;&#x043E;&#x0443;&#x0433;&#x043E;&#x043B;&#x044C;&#x043D;&#x043E;&#x0439; &#x0442;&#x0430;&#x0431;&#x043B;&#x0438;&#x0446;&#x0435; <span 
class="cmmi-10">n </span><span 
class="cmsy-10">&#x00D7; </span><span 
class="cmmi-10">m </span>&#x0437;&#x0430;&#x043F;&#x0438;&#x0441;&#x0430;&#x043D;&#x044B; &#x043F;&#x0440;&#x043E;&#x0438;&#x0437;&#x0432;&#x043E;&#x043B;&#x044C;&#x043D;&#x044B;&#x0435; &#x0432;&#x0435;&#x0449;&#x0435;&#x0441;&#x0442;&#x0432;&#x0435;&#x043D;&#x043D;&#x044B;&#x0435; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430;. &#x0420;&#x0430;&#x0437;&#x0440;&#x0435;&#x0448;&#x0430;&#x0435;&#x0442;&#x0441;&#x044F; &#x043C;&#x0435;&#x043D;&#x044F;&#x0442;&#x044C;
     &#x0437;&#x043D;&#x0430;&#x043A;  &#x0443;  &#x0432;&#x0441;&#x0435;&#x0445;  &#x0447;&#x0438;&#x0441;&#x0435;&#x043B;  &#x043A;&#x0430;&#x043A;&#x043E;&#x0439;-&#x043B;&#x0438;&#x0431;&#x043E;  &#x0441;&#x0442;&#x0440;&#x043E;&#x043A;&#x0438;  &#x0438;&#x043B;&#x0438;  &#x043A;&#x0430;&#x043A;&#x043E;&#x0433;&#x043E;-&#x043B;&#x0438;&#x0431;&#x043E;  &#x0441;&#x0442;&#x043E;&#x043B;&#x0431;&#x0446;&#x0430;.  &#x041F;&#x0440;&#x0438;&#x0434;&#x0443;&#x043C;&#x0430;&#x0439;&#x0442;&#x0435;  &#x0430;&#x043B;&#x0433;&#x043E;&#x0440;&#x0438;&#x0442;&#x043C;,  &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x044B;&#x0439;
     &#x0432;&#x044B;&#x043F;&#x043E;&#x043B;&#x044F;&#x044F; &#x0440;&#x0430;&#x0437;&#x0440;&#x0435;&#x0448;&#x0451;&#x043D;&#x043D;&#x044B;&#x0435; &#x043E;&#x043F;&#x0435;&#x0440;&#x0430;&#x0446;&#x0438;&#x0438; &#x0434;&#x043E;&#x0431;&#x044A;&#x0451;&#x0442;&#x0441;&#x044F; &#x0442;&#x043E;&#x0433;&#x043E;, &#x0447;&#x0442;&#x043E;&#x0431;&#x044B; &#x0432; &#x043A;&#x0430;&#x0436;&#x0434;&#x043E;&#x0439; &#x0441;&#x0442;&#x0440;&#x043E;&#x043A;&#x0435; &#x0438; &#x0441;&#x0442;&#x043E;&#x043B;&#x0431;&#x0446;&#x0435; &#x0441;&#x0443;&#x043C;&#x043C;&#x0430; &#x0447;&#x0438;&#x0441;&#x0435;&#x043B; &#x0431;&#x044B;&#x043B;&#x0430;
     &#x0431;&#x044B; &#x043D;&#x0435;&#x043E;&#x0442;&#x0440;&#x0438;&#x0446;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x0430;. &#x041E;&#x0446;&#x0435;&#x043D;&#x0438;&#x0442;&#x0435; &#x0432;&#x0440;&#x0435;&#x043C;&#x044F; &#x0440;&#x0430;&#x0431;&#x043E;&#x0442;&#x044B;.
     </li>
     <li 
  class="enumerate" id="x1-9x4">&#x0414;&#x043E;&#x043A;&#x0430;&#x0436;&#x0438;&#x0442;&#x0435;, &#x0447;&#x0442;&#x043E; &#x0433;&#x0440;&#x0443;&#x043F;&#x043F;&#x0443; &#x043B;&#x044E;&#x0434;&#x0435;&#x0439; &#x0432;&#x0441;&#x0435;&#x0433;&#x0434;&#x0430; &#x043C;&#x043E;&#x0436;&#x043D;&#x043E; &#x0440;&#x0430;&#x0437;&#x0431;&#x0438;&#x0442;&#x044C; &#x043D;&#x0430; &#x0434;&#x0432;&#x0435; &#x043A;&#x043E;&#x043C;&#x0430;&#x043D;&#x0434;&#x044B; &#x0442;&#x0430;&#x043A;, &#x0447;&#x0442;&#x043E;&#x0431;&#x044B; &#x043E;&#x0431;&#x0449;&#x0435;&#x0435; &#x0447;&#x0438;&#x0441;&#x043B;&#x043E; &#x043F;&#x0430;&#x0440;
     &#x0434;&#x0440;&#x0443;&#x0437;&#x0435;&#x0439;, &#x043E;&#x043A;&#x0430;&#x0437;&#x0430;&#x0432;&#x0448;&#x0438;&#x0445;&#x0441;&#x044F; &#x0432; &#x043E;&#x0434;&#x043D;&#x043E;&#x0439; &#x0438; &#x0442;&#x043E;&#x0439; &#x0436;&#x0435; &#x043A;&#x043E;&#x043C;&#x0430;&#x043D;&#x0434;&#x0435;, &#x0431;&#x044B;&#x043B;&#x043E; &#x043C;&#x0435;&#x043D;&#x044C;&#x0448;&#x0435; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430; &#x043F;&#x0430;&#x0440; &#x0434;&#x0440;&#x0443;&#x0437;&#x0435;&#x0439;, &#x043E;&#x043A;&#x0430;&#x0437;&#x0430;&#x0432;&#x0448;&#x0438;&#x0445;&#x0441;&#x044F; &#x0432;
     &#x0440;&#x0430;&#x0437;&#x043D;&#x044B;&#x0445; &#x043A;&#x043E;&#x043C;&#x0430;&#x043D;&#x0434;&#x0430;&#x0445;.
     </li>
     <li 
  class="enumerate" id="x1-11x5">&#x0412; &#x0422;&#x0440;&#x0438;&#x0434;&#x0435;&#x0432;&#x044F;&#x0442;&#x043E;&#x043C; &#x043A;&#x043E;&#x0440;&#x043E;&#x043B;&#x0435;&#x0432;&#x0441;&#x0442;&#x0432;&#x0435; &#x0435;&#x0441;&#x0442;&#x044C; &#x043C;&#x043E;&#x043D;&#x0435;&#x0442;&#x044B; &#x043D;&#x043E;&#x043C;&#x0438;&#x043D;&#x0430;&#x043B;&#x043E;&#x043C; <span 
class="cmr-10">1</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">10</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">100</span><span 
class="cmmi-10">,</span><span 
class="cmmi-10">&#x2026;</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">10</span><sup><span 
class="cmr-7">10</span></sup> &#x0440;&#x0443;&#x0431;&#x043B;&#x0435;&#x0439;. &#x0416;&#x0438;&#x0442;&#x0435;&#x043B;&#x044C; &#x043A;&#x043E;&#x0440;&#x043E;&#x043B;&#x0435;&#x0432;&#x0441;&#x0442;&#x0432;&#x0430;,
     &#x043D;&#x0430;&#x043A;&#x043E;&#x043F;&#x0438;&#x0432; &#x043D;&#x0435;&#x0441;&#x043A;&#x043E;&#x043B;&#x044C;&#x043A;&#x043E; &#x043C;&#x043E;&#x043D;&#x0435;&#x0442;, &#x0437;&#x0430;&#x043A;&#x043B;&#x044E;&#x0447;&#x0438;&#x043B; &#x0441;&#x0434;&#x0435;&#x043B;&#x043A;&#x0443; &#x0441; &#x0434;&#x044C;&#x044F;&#x0432;&#x043E;&#x043B;&#x043E;&#x043C;, &#x043F;&#x043E; &#x0443;&#x0441;&#x043B;&#x043E;&#x0432;&#x0438;&#x044F;&#x043C; &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x043E;&#x0439; &#x043E;&#x043D; &#x043E;&#x0431;&#x044F;&#x0437;&#x0430;&#x043D; &#x043A;&#x0430;&#x0436;&#x0434;&#x044B;&#x0439; &#x0434;&#x0435;&#x043D;&#x044C;
     &#x043E;&#x0442;&#x0434;&#x0430;&#x0432;&#x0430;&#x0442;&#x044C; &#x0434;&#x044C;&#x044F;&#x0432;&#x043E;&#x043B;&#x0443; &#x043A;&#x0430;&#x043A;&#x0443;&#x044E;-&#x0442;&#x043E; &#x043C;&#x043E;&#x043D;&#x0435;&#x0442;&#x0443;. &#x041F;&#x0440;&#x0438; &#x044D;&#x0442;&#x043E;&#x043C; &#x0432; &#x043E;&#x0431;&#x043C;&#x0435;&#x043D; &#x043E;&#x043D; &#x043C;&#x043E;&#x0436;&#x0435;&#x0442; &#x043F;&#x043E;&#x043B;&#x0443;&#x0447;&#x0438;&#x0442;&#x044C; &#x043B;&#x044E;&#x0431;&#x043E;&#x0435; &#x043A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E; &#x043C;&#x043E;&#x043D;&#x0435;&#x0442;
     &#x043C;&#x0435;&#x043D;&#x044C;&#x0448;&#x0435;&#x0433;&#x043E; &#x0434;&#x043E;&#x0441;&#x0442;&#x043E;&#x0438;&#x043D;&#x0441;&#x0442;&#x0432;&#x0430;, &#x0435;&#x0441;&#x043B;&#x0438; &#x0442;&#x0430;&#x043A;&#x0438;&#x0435; &#x0435;&#x0441;&#x0442;&#x044C;. &#x041D;&#x0430;&#x043F;&#x0440;&#x0438;&#x043C;&#x0435;&#x0440;, &#x043E;&#x0442;&#x0434;&#x0430;&#x0432;&#x0430;&#x044F; &#x043C;&#x043E;&#x043D;&#x0435;&#x0442;&#x0443; &#x0432; <span 
class="cmr-10">100 </span>&#x0440;&#x0443;&#x0431;&#x043B;&#x0435;&#x0439;, &#x043E;&#x043D; &#x043C;&#x043E;&#x0436;&#x0435;&#x0442; &#x0437;&#x0430;&#x0431;&#x0440;&#x0430;&#x0442;&#x044C;
     <span 
class="cmr-10">50 </span>&#x043C;&#x043E;&#x043D;&#x0435;&#x0442; &#x043F;&#x043E; <span 
class="cmr-10">10 </span>&#x0440;&#x0443;&#x0431;&#x043B;&#x0435;&#x0439; &#x0438; <span 
class="cmr-10">500 </span>&#x043C;&#x043E;&#x043D;&#x0435;&#x0442; &#x043F;&#x043E; <span 
class="cmr-10">1 </span>&#x0440;&#x0443;&#x0431;&#x043B;&#x044E;. &#x0415;&#x0441;&#x043B;&#x0438; &#x0436;&#x0435; &#x0435;&#x043C;&#x0443; &#x043D;&#x0435;&#x0447;&#x0435;&#x0433;&#x043E; &#x043E;&#x0442;&#x0434;&#x0430;&#x0442;&#x044C;, &#x0442;&#x043E; &#x043E;&#x043D; &#x043E;&#x0442;&#x043F;&#x0440;&#x0430;&#x0432;&#x043B;&#x044F;&#x0435;&#x0442;&#x0441;&#x044F; &#x0432; &#x0430;&#x0434;.
     &#x0414;&#x043E;&#x043A;&#x0430;&#x0436;&#x0438;&#x0442;&#x0435;, &#x0447;&#x0442;&#x043E; &#x0436;&#x0438;&#x0442;&#x0435;&#x043B;&#x044C; &#x043D;&#x0435; &#x0441;&#x043C;&#x043E;&#x0436;&#x0435;&#x0442; &#x0436;&#x0438;&#x0442;&#x044C; &#x0431;&#x0435;&#x0441;&#x043A;&#x043E;&#x043D;&#x0435;&#x0447;&#x043D;&#x043E;.
     </li>
     <li 
  class="enumerate" id="x1-13x6">&#x0418;&#x043C;&#x0435;&#x0435;&#x0442;&#x0441;&#x044F; <span 
class="cmmi-10">n </span>&#x0433;&#x0438;&#x0440;&#x044C;. &#x0412;&#x0435;&#x0441; <span 
class="cmmi-10">i</span>-&#x043E;&#x0439; &#x0433;&#x0438;&#x0440;&#x0438; &#x0446;&#x0435;&#x043B;&#x043E;&#x0435; &#x0447;&#x0438;&#x0441;&#x043B;&#x043E; <span 
class="cmr-10">0 </span><span 
class="msam-10">&#x2264; </span><span 
class="cmmi-10">a</span><sub><span 
class="cmmi-7">i</span></sub>  <span 
class="msam-10">&#x2264; </span><span 
class="cmmi-10">i</span>. &#x0418;&#x0437;&#x0432;&#x0435;&#x0441;&#x0442;&#x043D;&#x043E;, &#x0447;&#x0442;&#x043E; &#x0441;&#x0443;&#x043C;&#x043C;&#x0430; &#x0432;&#x0435;&#x0441;&#x043E;&#x0432; &#x0433;&#x0438;&#x0440;&#x044C; &#x0447;&#x0451;&#x0442;&#x043D;&#x0430;&#x044F;.
     &#x041F;&#x0440;&#x0438;&#x0434;&#x0443;&#x043C;&#x0430;&#x0439;&#x0442;&#x0435; &#x0430;&#x043B;&#x0433;&#x043E;&#x0440;&#x0438;&#x0442;&#x043C;, &#x0440;&#x0430;&#x0441;&#x043A;&#x043B;&#x0430;&#x0434;&#x044B;&#x0432;&#x0430;&#x044E;&#x0449;&#x0438;&#x0439; &#x0432;&#x0441;&#x0435; &#x0433;&#x0438;&#x0440;&#x0438; &#x043D;&#x0430; &#x0434;&#x0432;&#x0435; &#x0447;&#x0430;&#x0448;&#x0438; &#x0432;&#x0435;&#x0441;&#x043E;&#x0432; &#x0442;&#x0430;&#x043A;, &#x0447;&#x0442;&#x043E;&#x0431;&#x044B; &#x0447;&#x0430;&#x0448;&#x0438; &#x043D;&#x0430;&#x0445;&#x043E;&#x0434;&#x0438;&#x043B;&#x0438;&#x0441;&#x044C; &#x0432;
     &#x0440;&#x0430;&#x0432;&#x043D;&#x043E;&#x0432;&#x0435;&#x0441;&#x0438;&#x0438;. <span 
class="cmmi-10">O</span><span 
class="cmr-10">(</span><span 
class="cmmi-10">n</span><span 
class="cmr-10">)</span>
     </li>
     <li 
  class="enumerate" id="x1-15x7">&#x0430;) &#x0414;&#x0430;&#x043D;&#x0430; &#x0444;&#x0443;&#x043D;&#x043A;&#x0446;&#x0438;&#x044F; <span 
class="cmmi-10">f  </span><span 
class="cmr-10">:  </span><span 
class="cmsy-10">{</span><span 
class="cmr-10">1</span><span 
class="cmmi-10">,</span><span 
class="cmmi-10">&#x2026;</span><span 
class="cmmi-10">,N</span><span 
class="cmsy-10">} &#x2192; {</span><span 
class="cmr-10">1</span><span 
class="cmmi-10">,</span><span 
class="cmmi-10">&#x2026;</span><span 
class="cmmi-10">,N</span><span 
class="cmsy-10">}</span>.  &#x041D;&#x0430;&#x0439;&#x0442;&#x0438; &#x043F;&#x0435;&#x0440;&#x0438;&#x043E;&#x0434; &#x043F;&#x043E;&#x0441;&#x043B;&#x0435;&#x0434;&#x043E;&#x0432;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E;&#x0441;&#x0442;&#x0438; <span 
class="cmr-10">1</span><span 
class="cmmi-10">,f</span><span 
class="cmr-10">(1)</span><span 
class="cmmi-10">,f</span><span 
class="cmr-10">(</span><span 
class="cmmi-10">f</span><span 
class="cmr-10">(1))</span><span 
class="cmmi-10">,</span><span 
class="cmmi-10">&#x2026;</span><span style="margin-left:0.3em" class="thinspace"></span>.
     &#x041A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E; &#x0434;&#x0435;&#x0439;&#x0441;&#x0442;&#x0432;&#x0438;&#x0439; &#x0434;&#x043E;&#x043B;&#x0436;&#x043D;&#x043E; &#x0431;&#x044B;&#x0442;&#x044C; &#x043F;&#x0440;&#x043E;&#x043F;&#x043E;&#x0440;&#x0446;&#x0438;&#x043E;&#x043D;&#x0430;&#x043B;&#x044C;&#x043D;&#x043E; &#x0441;&#x0443;&#x043C;&#x043C;&#x0430;&#x0440;&#x043D;&#x043E;&#x0439; &#x0434;&#x043B;&#x0438;&#x043D;&#x0435; &#x043F;&#x0440;&#x0435;&#x0434;&#x043F;&#x0435;&#x0440;&#x0438;&#x043E;&#x0434;&#x0430; &#x0438; &#x043F;&#x0435;&#x0440;&#x0438;&#x043E;&#x0434;&#x0430;. <br 
class="newline" />&#x0431;) &#x0414;&#x0430;&#x043D; &#x043C;&#x0430;&#x0441;&#x0441;&#x0438;&#x0432; &#x0447;&#x0438;&#x0441;&#x0435;&#x043B; <span 
class="cmmi-10">a</span><sub><span 
class="cmr-7">1</span></sub><span 
class="cmmi-10">,a</span><sub><span 
class="cmr-7">2</span></sub><span 
class="cmmi-10">,</span><span 
class="cmmi-10">&#x2026;</span><span 
class="cmmi-10">,a</span><sub><span 
class="cmmi-7">n</span><span 
class="cmr-7">+1</span></sub>, &#x0433;&#x0434;&#x0435; <span 
class="cmmi-10">a</span><sub><span 
class="cmmi-7">i</span></sub> <span 
class="cmsy-10">&#x2208;{</span><span 
class="cmr-10">1</span><span 
class="cmmi-10">,</span><span 
class="cmmi-10">&#x2026;</span><span 
class="cmmi-10">,n</span><span 
class="cmsy-10">} </span>&#x0434;&#x043B;&#x044F; &#x0432;&#x0441;&#x0435;&#x0445; <span 
class="cmmi-10">i </span><span 
class="cmr-10">= 1</span><span 
class="cmmi-10">,</span><span 
class="cmmi-10">&#x2026;</span><span 
class="cmmi-10">,n </span><span 
class="cmr-10">+ 1</span>. &#x041D;&#x0430;&#x0439;&#x0434;&#x0438;&#x0442;&#x0435; &#x043F;&#x043E;&#x0432;&#x0442;&#x043E;&#x0440;&#x044F;&#x044E;&#x0449;&#x0438;&#x0435;&#x0441;&#x044F;
     &#x0437;&#x043D;&#x0430;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F;, &#x043F;&#x0440;&#x0438; &#x0443;&#x0441;&#x043B;&#x043E;&#x0432;&#x0438;&#x0438;, &#x0447;&#x0442;&#x043E; &#x043C;&#x043E;&#x0436;&#x043D;&#x043E; &#x0438;&#x0441;&#x043F;&#x043E;&#x043B;&#x044C;&#x0437;&#x043E;&#x0432;&#x0430;&#x0442;&#x044C; &#x0442;&#x043E;&#x043B;&#x044C;&#x043A;&#x043E; &#x043F;&#x043E;&#x0441;&#x0442;&#x043E;&#x044F;&#x043D;&#x043D;&#x043E;&#x0435;, &#x043D;&#x0435; &#x0437;&#x0430;&#x0432;&#x0438;&#x0441;&#x044F;&#x0449;&#x0435;&#x0435; &#x043E;&#x0442; <span 
class="cmmi-10">n</span>, &#x043A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E;
     &#x0434;&#x043E;&#x043F;&#x043E;&#x043B;&#x043D;&#x0438;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x044B;&#x0445; &#x043F;&#x0435;&#x0440;&#x0435;&#x043C;&#x0435;&#x043D;&#x043D;&#x044B;&#x0445;, &#x0441;&#x0434;&#x0435;&#x043B;&#x0430;&#x0432; <span 
class="cmmi-10">O</span><span 
class="cmr-10">(</span><span 
class="cmmi-10">n</span><span 
class="cmr-10">) </span>&#x0441;&#x0440;&#x0430;&#x0432;&#x043D;&#x0435;&#x043D;&#x0438;&#x0439;.
     </li>
     <li 
  class="enumerate" id="x1-17x8">&#x041D;&#x0430; &#x043A;&#x043B;&#x0435;&#x0442;&#x0447;&#x0430;&#x0442;&#x043E;&#x0439; &#x0434;&#x043E;&#x0441;&#x043A;&#x0435; <span 
class="cmr-10">100 </span><span 
class="cmsy-10">&#x00D7; </span><span 
class="cmr-10">100 </span>&#x0440;&#x0430;&#x0441;&#x0441;&#x0442;&#x0430;&#x0432;&#x043B;&#x0435;&#x043D;&#x043E; &#x043D;&#x0435;&#x0441;&#x043A;&#x043E;&#x043B;&#x044C;&#x043A;&#x043E; &#x0448;&#x0430;&#x0445;&#x043C;&#x0430;&#x0442;&#x043D;&#x044B;&#x0445; &#x043A;&#x043E;&#x043D;&#x0435;&#x0439;. &#x041A;&#x0430;&#x0436;&#x0434;&#x0443;&#x044E; &#x043C;&#x0438;&#x043D;&#x0443;&#x0442;&#x0443; &#x043E;&#x0434;&#x0438;&#x043D; &#x0438;&#x0437;
     &#x043A;&#x043E;&#x043D;&#x0435;&#x0439; &#x0434;&#x0435;&#x043B;&#x0430;&#x0435;&#x0442; &#x0445;&#x043E;&#x0434; &#x043D;&#x0430; &#x0441;&#x0432;&#x043E;&#x0431;&#x043E;&#x0434;&#x043D;&#x043E;&#x0435; &#x043F;&#x043E;&#x043B;&#x0435;. &#x0427;&#x0435;&#x0440;&#x0435;&#x0437; &#x043D;&#x0435;&#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x043E;&#x0435; &#x0432;&#x0440;&#x0435;&#x043C;&#x044F; &#x043E;&#x043A;&#x0430;&#x0437;&#x0430;&#x043B;&#x043E;&#x0441;&#x044C;, &#x0447;&#x0442;&#x043E; &#x043A;&#x0430;&#x0436;&#x0434;&#x044B;&#x0439; &#x043F;&#x043E;&#x0431;&#x044B;&#x0432;&#x0430;&#x043B; &#x043D;&#x0430; &#x0432;&#x0441;&#x0435;&#x0445;
     &#x043F;&#x043E;&#x043B;&#x044F;&#x0445; &#x0440;&#x043E;&#x0432;&#x043D;&#x043E; &#x043F;&#x043E; &#x043E;&#x0434;&#x043D;&#x043E;&#x043C;&#x0443; &#x0440;&#x0430;&#x0437;&#x0443; &#x0438; &#x0432;&#x0435;&#x0440;&#x043D;&#x0443;&#x043B;&#x0441;&#x044F; &#x0432; &#x0438;&#x0441;&#x0445;&#x043E;&#x0434;&#x043D;&#x0443;&#x044E; &#x043A;&#x043B;&#x0435;&#x0442;&#x043A;&#x0443;. &#x0414;&#x043E;&#x043A;&#x0430;&#x0436;&#x0438;&#x0442;&#x0435;, &#x0447;&#x0442;&#x043E; &#x0431;&#x044B;&#x043B; &#x043C;&#x043E;&#x043C;&#x0435;&#x043D;&#x0442;, &#x043A;&#x043E;&#x0433;&#x0434;&#x0430; &#x0432;&#x0441;&#x0435;
     &#x043A;&#x043E;&#x043D;&#x0438; &#x0441;&#x0442;&#x043E;&#x044F;&#x043B;&#x0438; &#x043D;&#x0435; &#x043D;&#x0430; &#x0441;&#x0432;&#x043E;&#x0438;&#x0445; &#x043C;&#x0435;&#x0441;&#x0442;&#x0430;&#x0445;.
     </li>
     <li 
  class="enumerate" id="x1-19x9">&#x0412;  &#x043D;&#x0435;&#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x043E;&#x0439;  &#x0441;&#x0442;&#x0440;&#x0430;&#x043D;&#x0435;  &#x043A;&#x0430;&#x0436;&#x0434;&#x044B;&#x0439;  &#x0433;&#x043E;&#x0440;&#x043E;&#x0434;  &#x0441;&#x043E;&#x0435;&#x0434;&#x0438;&#x043D;&#x0451;&#x043D;  &#x0441;  &#x043A;&#x0430;&#x0436;&#x0434;&#x044B;&#x043C;  &#x0434;&#x043E;&#x0440;&#x043E;&#x0433;&#x043E;&#x0439;  &#x0441;  &#x043E;&#x0434;&#x043D;&#x043E;&#x0441;&#x0442;&#x043E;&#x0440;&#x043E;&#x043D;&#x043D;&#x0438;&#x043C;  &#x0434;&#x0432;&#x0438;&#x0436;&#x0435;&#x043D;&#x0438;&#x0435;&#x043C;.
     &#x0414;&#x043E;&#x043A;&#x0430;&#x0436;&#x0438;&#x0442;&#x0435;, &#x0447;&#x0442;&#x043E; &#x043D;&#x0430;&#x0439;&#x0434;&#x0451;&#x0442;&#x0441;&#x044F; &#x0433;&#x043E;&#x0440;&#x043E;&#x0434;, &#x0438;&#x0437; &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x043E;&#x0433;&#x043E; &#x043C;&#x043E;&#x0436;&#x043D;&#x043E; &#x0434;&#x043E;&#x0431;&#x0440;&#x0430;&#x0442;&#x044C;&#x0441;&#x044F; &#x0432; &#x043B;&#x044E;&#x0431;&#x043E;&#x0439; &#x0434;&#x0440;&#x0443;&#x0433;&#x043E;&#x0439;.
     </li>
     <li 
  class="enumerate" id="x1-21x10">&#x0412; &#x043E;&#x0434;&#x043D;&#x043E;&#x043C; &#x0433;&#x043E;&#x0441;&#x0443;&#x0434;&#x0430;&#x0440;&#x0441;&#x0442;&#x0432;&#x0435; <span 
class="cmr-10">100 </span>&#x0433;&#x043E;&#x0440;&#x043E;&#x0434;&#x043E;&#x0432; &#x0438; &#x043A;&#x0430;&#x0436;&#x0434;&#x044B;&#x0439; &#x0441;&#x043E;&#x0435;&#x0434;&#x0438;&#x043D;&#x0451;&#x043D; &#x0441; &#x043A;&#x0430;&#x0436;&#x0434;&#x044B;&#x043C; &#x0434;&#x043E;&#x0440;&#x043E;&#x0433;&#x043E;&#x0439; &#x0441; &#x043E;&#x0434;&#x043D;&#x043E;&#x0441;&#x0442;&#x043E;&#x0440;&#x043E;&#x043D;&#x043D;&#x0438;&#x043C; &#x0434;&#x0432;&#x0438;&#x0436;&#x0435;&#x043D;&#x0438;&#x0435;&#x043C;.
     &#x0414;&#x043E;&#x043A;&#x0430;&#x0436;&#x0438;&#x0442;&#x0435;, &#x0447;&#x0442;&#x043E; &#x043C;&#x043E;&#x0436;&#x043D;&#x043E; &#x043F;&#x043E;&#x043C;&#x0435;&#x043D;&#x044F;&#x0442;&#x044C; &#x043D;&#x0430;&#x043F;&#x0440;&#x0430;&#x0432;&#x043B;&#x0435;&#x043D;&#x0438;&#x0435; &#x0434;&#x0432;&#x0438;&#x0436;&#x0435;&#x043D;&#x0438;&#x044F; &#x043D;&#x0430; &#x043E;&#x0434;&#x043D;&#x043E;&#x0439; &#x0434;&#x043E;&#x0440;&#x043E;&#x0433;&#x0435; &#x0442;&#x0430;&#x043A;, &#x0447;&#x0442;&#x043E; &#x043E;&#x0442; &#x043B;&#x044E;&#x0431;&#x043E;&#x0433;&#x043E; &#x0433;&#x043E;&#x0440;&#x043E;&#x0434;&#x0430;
     &#x043C;&#x043E;&#x0436;&#x043D;&#x043E; &#x0431;&#x044B;&#x043B;&#x043E; &#x0434;&#x043E;&#x0435;&#x0445;&#x0430;&#x0442;&#x044C; &#x0434;&#x043E; &#x043B;&#x044E;&#x0431;&#x043E;&#x0433;&#x043E; &#x0434;&#x0440;&#x0443;&#x0433;&#x043E;&#x0433;&#x043E;.
     </li>
     <li 
  class="enumerate" id="x1-23x11">&#x0412; &#x0433;&#x043E;&#x0440;&#x043E;&#x0434;&#x0435; &#x041D;&#x0435;&#x0437;&#x043D;&#x0430;&#x043A;&#x043E;&#x043C;&#x0441;&#x043A;&#x0435; &#x0436;&#x0438;&#x0432;&#x0443;&#x0442; <span 
class="cmr-10">3</span><span 
class="cmmi-10">n </span>&#x0447;&#x0435;&#x043B;&#x043E;&#x0432;&#x0435;&#x043A;, &#x043F;&#x0440;&#x0438;&#x0447;&#x0435;&#x043C; &#x043B;&#x044E;&#x0431;&#x044B;&#x0435; &#x0434;&#x0432;&#x043E;&#x0435; &#x0438;&#x043C;&#x0435;&#x044E;&#x0442; &#x043E;&#x0431;&#x0449;&#x0435;&#x0433;&#x043E; &#x0437;&#x043D;&#x0430;&#x043A;&#x043E;&#x043C;&#x043E;&#x0433;&#x043E;. &#x0414;&#x043E;&#x043A;&#x0430;&#x0436;&#x0438;&#x0442;&#x0435;,
     &#x0447;&#x0442;&#x043E; &#x043C;&#x043E;&#x0436;&#x043D;&#x043E; &#x0443;&#x043A;&#x0430;&#x0437;&#x0430;&#x0442;&#x044C; <span 
class="cmmi-10">n </span>&#x0447;&#x0435;&#x043B;&#x043E;&#x0432;&#x0435;&#x043A; &#x0442;&#x0430;&#x043A;&#x0438;&#x043C; &#x043E;&#x0431;&#x0440;&#x0430;&#x0437;&#x043E;&#x043C;, &#x0447;&#x0442;&#x043E;&#x0431;&#x044B; &#x043A;&#x0430;&#x0436;&#x0434;&#x044B;&#x0439; &#x0438;&#x0437; &#x043E;&#x0441;&#x0442;&#x0430;&#x043B;&#x044C;&#x043D;&#x044B;&#x0445; &#x0431;&#x044B;&#x043B; &#x0437;&#x043D;&#x0430;&#x043A;&#x043E;&#x043C; &#x0445;&#x043E;&#x0442;&#x044F; &#x0431;&#x044B; &#x0441;
     &#x043E;&#x0434;&#x043D;&#x0438;&#x043C; &#x0447;&#x0435;&#x043B;&#x043E;&#x0432;&#x0435;&#x043A;&#x043E;&#x043C; &#x0438;&#x0437; &#x044D;&#x0442;&#x0438;&#x0445; <span 
class="cmmi-10">n</span>.

     </li>
     <li 
  class="enumerate" id="x1-25x12">&#x041D;&#x0430;&#x0437;&#x043E;&#x0432;&#x0435;&#x043C;  &#x043B;&#x0430;&#x0431;&#x0438;&#x0440;&#x0438;&#x043D;&#x0442;&#x043E;&#x043C;  &#x0434;&#x043E;&#x0441;&#x043A;&#x0443;  <span 
class="cmr-10">100 </span><span 
class="cmsy-10">&#x00D7; </span><span 
class="cmr-10">100</span>,  &#x0433;&#x0434;&#x0435;  &#x0432;  &#x043D;&#x0435;&#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x044B;&#x0445;  &#x043C;&#x0435;&#x0441;&#x0442;&#x0430;&#x0445;  &#x043D;&#x0430;  &#x0433;&#x0440;&#x0430;&#x043D;&#x0438;&#x0446;&#x044B;  &#x043A;&#x043B;&#x0435;&#x0442;&#x043E;&#x043A;  &#x043F;&#x0440;&#x0438;&#x043A;&#x043B;&#x0435;&#x0435;&#x043D;&#x044B;
     &#x043F;&#x0435;&#x0440;&#x0435;&#x0433;&#x043E;&#x0440;&#x043E;&#x0434;&#x043A;&#x0438;, &#x043D;&#x043E; &#x0442;&#x0430;&#x043A;, &#x0447;&#x0442;&#x043E; &#x043B;&#x0430;&#x0434;&#x044C;&#x044F; &#x043C;&#x043E;&#x0436;&#x0435;&#x0442; &#x0441;&#x043E;&#x0439;&#x0442;&#x0438; &#x0441; &#x0434;&#x043E;&#x0441;&#x043A;&#x0438;, &#x043D;&#x0430;&#x0447;&#x0430;&#x0432; &#x0434;&#x0432;&#x0438;&#x0436;&#x0435;&#x043D;&#x0438;&#x0435; &#x0438;&#x0437; &#x043B;&#x044E;&#x0431;&#x043E;&#x0439; &#x043A;&#x043B;&#x0435;&#x0442;&#x043A;&#x0438;. &#x041F;&#x043E; &#x043A;&#x043E;&#x043C;&#x0430;&#x043D;&#x0434;&#x0435;
     &#x0412;&#x041F;&#x0420;&#x0410;&#x0412;&#x041E; &#x043B;&#x0430;&#x0434;&#x044C;&#x044F; &#x0441;&#x043C;&#x0435;&#x0449;&#x0430;&#x0435;&#x0442;&#x0441;&#x044F; &#x043D;&#x0430; &#x043E;&#x0434;&#x043D;&#x043E; &#x043F;&#x043E;&#x043B;&#x0435; &#x0432;&#x043F;&#x0440;&#x0430;&#x0432;&#x043E; &#x0438;&#x043B;&#x0438; &#x0432;&#x044B;&#x0445;&#x043E;&#x0434;&#x0438;&#x0442; &#x0437;&#x0430; &#x043F;&#x0440;&#x0435;&#x0434;&#x0435;&#x043B;&#x044B; &#x0434;&#x043E;&#x0441;&#x043A;&#x0438;, &#x043D;&#x043E; &#x0435;&#x0441;&#x043B;&#x0438; &#x0441;&#x043F;&#x0440;&#x0430;&#x0432;&#x0430;
     &#x043F;&#x0435;&#x0440;&#x0435;&#x0433;&#x043E;&#x0440;&#x043E;&#x0434;&#x043A;&#x0430;,  &#x043E;&#x0441;&#x0442;&#x0430;&#x0435;&#x0442;&#x0441;&#x044F;  &#x043D;&#x0430;  &#x043C;&#x0435;&#x0441;&#x0442;&#x0435;;  &#x0430;&#x043D;&#x0430;&#x043B;&#x043E;&#x0433;&#x0438;&#x0447;&#x043D;&#x043E;  &#x0432;&#x044B;&#x043F;&#x043E;&#x043B;&#x043D;&#x044F;&#x044E;&#x0442;&#x0441;&#x044F;  &#x043A;&#x043E;&#x043C;&#x0430;&#x043D;&#x0434;&#x044B;  &#x0412;&#x041B;&#x0415;&#x0412;&#x041E;,  &#x0412;&#x0412;&#x0415;&#x0420;&#x0425;  &#x0438;  &#x0412;&#x041D;&#x0418;&#x0417;.
     &#x041A;&#x043E;&#x043D;&#x0435;&#x0447;&#x043D;&#x0443;&#x044E; &#x043F;&#x043E;&#x0441;&#x043B;&#x0435;&#x0434;&#x043E;&#x0432;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E;&#x0441;&#x0442;&#x044C; &#x0442;&#x0430;&#x043A;&#x0438;&#x0445; &#x043A;&#x043E;&#x043C;&#x0430;&#x043D;&#x0434; &#x043D;&#x0430;&#x0437;&#x043E;&#x0432;&#x0435;&#x043C; &#x043F;&#x0440;&#x043E;&#x0433;&#x0440;&#x0430;&#x043C;&#x043C;&#x043E;&#x0439;. &#x041A;&#x0430;&#x043A; &#x0442;&#x043E;&#x043B;&#x044C;&#x043A;&#x043E; &#x043B;&#x0430;&#x0434;&#x044C;&#x044F; &#x0441;&#x043E;&#x0448;&#x043B;&#x0430; &#x0441; &#x0434;&#x043E;&#x0441;&#x043A;&#x0438;,
     &#x043F;&#x0440;&#x043E;&#x0433;&#x0440;&#x0430;&#x043C;&#x043C;&#x0430; &#x043E;&#x0441;&#x0442;&#x0430;&#x043D;&#x0430;&#x0432;&#x043B;&#x0438;&#x0432;&#x0430;&#x0435;&#x0442;&#x0441;&#x044F;. &#x0414;&#x043E;&#x043A;&#x0430;&#x0436;&#x0438;&#x0442;&#x0435;, &#x0447;&#x0442;&#x043E; &#x0435;&#x0441;&#x0442;&#x044C; &#x043E;&#x0434;&#x043D;&#x0430; &#x043F;&#x0440;&#x043E;&#x0433;&#x0440;&#x0430;&#x043C;&#x043C;&#x0430;, &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x0430;&#x044F; &#x0432;&#x044B;&#x0432;&#x043E;&#x0434;&#x0438;&#x0442; &#x043B;&#x0430;&#x0434;&#x044C;&#x044E; &#x0441; &#x043B;&#x044E;&#x0431;&#x043E;&#x0433;&#x043E;
     &#x043C;&#x0435;&#x0441;&#x0442;&#x0430; &#x0438;&#x0437; &#x043B;&#x044E;&#x0431;&#x043E;&#x0433;&#x043E; &#x043B;&#x0430;&#x0431;&#x0438;&#x0440;&#x0438;&#x043D;&#x0442;&#x0430;.
     </li></ol>
    
</body></html> 



